courseProject/Project/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.001;
//x
x1 132.50000000000000000000;
x2 137.17157500000000000000;
x3 142.82842500000000000000;
x4 147.50000000000000000000;
x5 152.17157500000000000000;
x6 157.82842500000000000000;
x7 172.50000000000000000000;
x8 187.17157500000000000000;
x9 192.82842500000000000000;
x10 207.50000000000000000000;
x11 220;
xCenter1 140;
xCenter11 136.00000000000000000000;
xCenter12 144.00000000000000000000;
xCenter2 155;
xCenter21 151.00000000000000000000;
xCenter22 159.00000000000000000000;
xCenter3 190;
xCenter31 186.00000000000000000000;
xCenter32 194.00000000000000000000;
//y
y1 27;
y2 16.17157500000000000000;
y3 21.82842500000000000000;
y4 7.17157500000000000000;
y5 12.82842500000000000000;
yCenter13 19;
yCenter131 15.00000000000000000000;
yCenter132 23.00000000000000000000;
yCenter2 10;
yCenter21 6.00000000000000000000;
yCenter22 14.00000000000000000000;

vertices
(
    (0 0 2) //0
    (0 $y1 2) //1
    ($x1 0 2) //2
    ($x1 $y1 2) //3
    ($x2  $y2 2) //4
    ($x2 $y3 2) //5
    ($x3 $y2 2) //6
    ($x3 $y3 2) //7
    ($x4 0 2) //8
    ($x4 $y1 2) //9
    ($x5 $y4 2) //10
    ($x5 $y5 2) //11
    ($x6 $y4 2) //12
    ($x6 $y5 2) //13
    ($x7 0 2) //14
    ($x7 $y1 2) //15
    ($x8 $y2 2) //16
    ($x8 $y3 2) //17
    ($x9 $y2 2) //18
    ($x9 $y3 2) //19
    ($x10 0 2) //20
    ($x10 $y1 2) //21
    ($x11 0 2) //22
    ($x11 $y1 2) //23
    (0 0 -2) //24
    (0 $y1 -2) //25
    ($x1 0 -2) //26
    ($x1 $y1 -2) //27
    ($x2  $y2 -2) //28
    ($x2 $y3 -2) //29
    ($x3 $y2 -2) //30
    ($x3 $y3 -2) //31
    ($x4 0 -2) //32
    ($x4 $y1 -2) //33
    ($x5 $y4 -2) //34
    ($x5 $y5 -2) //35
    ($x6 $y4 -2) //36
    ($x6 $y5 -2) //37
    ($x7 0 -2) //38
    ($x7 $y1 -2) //39
    ($x8 $y2 -2) //40
    ($x8 $y3 -2) //41
    ($x9 $y2 -2) //42
    ($x9 $y3 -2) //43
    ($x10 0 -2) //44
    ($x10 $y1 -2) //45
    ($x11 0 -2) //46
    ($x11 $y1 -2) //47
);

blocks
(
    // left blocks
    hex (0 2 26 24 1 3 27 25) (200 1 30) simpleGrading (1 1 1) 
    // cylinder1 blocks
    hex (2 8 32 26 4 6 30 28) (30 1 30) simpleGrading (1 1 1) // bottom
    hex (2 4 28 26 3 5 29 27) (30 1 30) simpleGrading (1 1 1) // left
    hex (5 7 31 29 3 9 33 27) (30 1 30) simpleGrading (1 1 1) // top
    hex (6 8 32 30 7 9 33 31) (30 1 30) simpleGrading (1 1 1) // right 
    // cylinder2 blocks
    hex (8 14 38 32 10 12 36 34) (30 1 30) simpleGrading (1 1 1) // bottom
    hex (8 10 34 32 9 11 35 33) (30 1 30) simpleGrading (1 1 1) // left
    hex (11 13 37 35 9 15 39 33) (30 1 30) simpleGrading (1 1 1) // top
    hex (12 14 38 36 13 15 39 37) (30 1 30) simpleGrading (1 1 1) // right 
    // cylinder3 blocks
    hex (14 20 44 38 16 18 42 40) (30 1 30) simpleGrading (1 1 1) // bottom
    hex (14 16 40 38 15 17 41 39) (30 1 30) simpleGrading (1 1 1) // left
    hex (17 19 43 41 15 21 45 39) (30 1 30) simpleGrading (1 1 1) // top
    hex (18 20 44 42 19 21 45 43) (30 1 30) simpleGrading (1 1 1) // right 
    // right block
    hex (20 22 46 44 21 23 47 45) (30 1 30) simpleGrading (1 1 1)



);

edges
(
    // cylinder 1
    // left
    arc 5 4 ($xCenter11 $yCenter13 2)
    arc 29 28 ($xCenter11 $yCenter13 -2)
    // right
    arc 7 6 ($xCenter12 $yCenter13 2)
    arc 30 31 ($xCenter12 $yCenter13 -2)
    // top
    arc 5 7 ($xCenter1 $yCenter132 2)
    arc 29 31 ($xCenter1 $yCenter132 -2)
    // bottom 
    arc 4 6 ($xCenter1 $yCenter131 2)
    arc 28 30 ($xCenter1 $yCenter131 -2)
    
    // cylinder 2
    // left
    arc 10 11 ($xCenter21 $yCenter2 2)
    arc 34 35 ($xCenter21 $yCenter2 -2)
    // right
    arc 12 13 ($xCenter22 $yCenter2 2)
    arc 36 37 ($xCenter22 $yCenter2 -2)
    // top
    arc 11 13 ($xCenter2 $yCenter22 2)
    arc 35 37 ($xCenter2 $yCenter22 -2)
    // bottom 
    arc 10 12 ($xCenter2 $yCenter21 2)
    arc 34 36 ($xCenter2 $yCenter21 -2)
    
    // cylinder 3
    // left
    arc 16 17 ($xCenter31 $yCenter13 2)
    arc 40 41 ($xCenter31 $yCenter13 -2)
    // right
    arc 18 19 ($xCenter32 $yCenter13 2)
    arc 42 43 ($xCenter32 $yCenter13 -2)
    // top
    arc 17 19 ($xCenter3 $yCenter132 2)
    arc 41 43 ($xCenter3 $yCenter132 -2)
    // bottom 
    arc 16 18 ($xCenter3 $yCenter131 2)
    arc 40 42 ($xCenter3 $yCenter131 -2)
);

defaultPatch
{
    
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 25 24)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (22 23 47 46)
        );
    }
    wall
    {
        type wall;
        faces
        (
            // top
            (1 3 27 25)
            (3 9 33 27)
            (9 15 39 33)
            (15 21 45 39)
            (21 23 47 45)
            // bottom
            (0 2 26 24)
            (2 8 32 26)
            (8 14 38 32)
            (14 20 44 38)
            (20 22 46 44)
        );
    }
    cylinder 
    {
        type wall;
        faces
        (
            //cylinder 1
            (4 5 29 28) // left
            (5 7 31 29) // top
            (6 7 31 30) // right
            (4 6 30 28) // bottom
            //cylinder 2
            (10 11 35 34) // left
            (11 13 37 35) // top
            (12 13 37 36) // right
            (10 12 36 34) // bottom
            //cylinder 3
            (16 17 41 40) // left
            (17 19 43 41) // top
            (18 19 43 42) // right
            (16 18 42 40) // bottom
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            // front
            // left block
            (0 2 3 1)
            // cylinder 1
            (2 4 5 3) //left
            (5 7 9 3) // top
            (6 8 9 7) // right
            (2 8 6 4) // bottom
            // cylinder 2
            (8 10 11 9) // left
            (11 13 15 9) // top
            (12 14 15 13) // right
            (8 14 12 10) // bottom
            // cylinder 3
            (14 16 17 15) //left
            (17 19 21 15) // top
            (18 20 21 19) // right
            (14 20 18 16) // bottom
            // right block
            (20 22 23 21)
            
            // back
            // left block
            (24 26 27 25)
            // cylinder 1
            (26 28 29 27) //left
            (29 31 33 27) // top
            (30 32 33 31) // right
            (26 32 30 28) // bottom
            // cylinder 2
            (32 34 35 33) //left
            (35 37 39 33) // top
            (36 38 39 37) // right
            (32 38 36 34) // bottom
            // cylinder 3 
            (38 40 41 39) //left
            (41 43 45 39) // top
            (42 44 45 43) // right
            (38 44 42 40) // bottom
            // right block
            (44 46 47 45)
        );
    }
);

// ************************************************************************* //
